{
    "id": "ncrvoyix-summer2024",
    "company": "NCR Voyix",
    "position": "Software Engineering Intern",
    "workType": "co-op",
    "location": "hybrid",
    "term": "Summer 2024",
    "date": "May 2024 - August 2024",
    "thumbnail": "/ncrvoyix.png",
    "technologies": ["Java", "PostgreSQL", "Microservices", "OAuth 2.0"],
    "sections": [
    {
        "title": "Introduction...",
        "content": "I am a fourth-year Software Engineering student at the University of Guelph with a passion for software to solve challenging problems. I love working in teams, solving challenging problems, and learning new technologies. I am always happy to expand my knowledge.\n\n        A little about me... why software engineering?\n\n        In 2019, I was a member of the International Tournament of Young Mathematicians in Barcelona, Spain. Each team in the competition had to solve ten investigational problems and present them to the jury. This competition helped me gain experience working as a team leader in a team. At first, we struggled, but when we were at our last chance to make it to the finals, we all felt immense pressure. Our team then agreed to present my solution. I was nervous but knew it was essential to remain calm and focused. We rose to the challenge and won the silver medal.\n\n        I demonstrated leadership when it was most needed and helped my team succeed. Afterwards, I understood that math was not only about solving thousands of typical problems for competition. Still, it was also about searching for unknown answers, brainstorming solutions for unsolved problems, and bringing ideas to life. That was when I decided to become a software developer. I love to apply my mathematical and team skills to developing valuable software."
    },
    {
        "title": "Where did I work...",
        "content": "I worked at the NCR Voyix for the Summer 2024 semester. NCR Voyix is the world's leading enterprise provider of software, hardware and services for banks. The company's segments include Retail, Hospitality and Digital Banking. I work in the Digital Banking section of the company. We provide technology solutions to enhance online and mobile banking experiences for financial institutions, offering services such as online account management, mobile banking apps, bill payment, security features and so much more.\n\n    I was a Software Engineering Intern who worked in the Pre-Staged('Wintermute') team. I worked on the Channel Services Platform (CSP) Teller products. For the past 4 months, I have been working on a Citibank project. The features we worked on required generating cashier checks and money order documents as well as integrating our software to connect to the printer. We have also worked on the feature to remove a polling mechanism to update balance and instead show balance updates live. To accomplish the tasks our team has been working with 3 other teams, building different components of the system. This was an exciting experience where I got to see the process of combining the work of multiple teams together on a tight deadline."
    },
    {
        "title": "What was I able to accomplish...",
        "content": "At work, I was able to continuously improve my technical and communication skills. For the duration of the Summer 2024 semester, I focused on trying to use different technologies, apply them to solve problems and come up with creative solutions. I wanted to improve the quality of my code and be able to write my code efficiently. I wanted to try myself more in architecture, trying to draw UML diagrams, suggesting ideas and discussing solutions with architects.\n\n    During my work time, I was able to expand my knowledge of architectural design and some Java-specific language features. I was always willing to help, transfer knowledge and learn from my mistakes. I actively participated in Scrum and design meetings. I contributed to the architecture design of the product as well as its implementation whilst focusing on high-quality code and meeting deadlines. I have taken challenging tasks involving talking to new people, trying new technologies and doing research. I consistently challenged myself with complex tasks, ensuring on-time delivery and high-quality results. I have been able to exercise and improve my critical thinking skills by coming up with creative solutions and resolving any bugs. I was able to quickly analyze and solve problems whenever it was needed. \n\n    I wanted to work as a software engineer because it is an in-demand position, and it exercises problem-solving skills. Also, this way I can contribute to the core functionality of the projects and understand their overall architecture. NCR Voyix gave me the ability to work on products that are released to customers, participate in debugging sessions and so much more. This position also promotes versatility in my career since I can understand and work on multiple technologies. Also, I participate in planning and design meetings as well as develop, debug and test code. I wanted to get development work in Java and Spring Boot and use technologies such as Docker and Kubernetes. All of these technologies are used in enterprise development and the experience of working with them will help me in my future jobs. "
    },
    {
        "title": "What did I work on...",
        "content": "As was mentioned before, I worked on multiple features. Bigger ones involved generating documents and printing a physical copy of them. Another feature that I really enjoyed working on was building a way to get the balance on the screen updated in real time. The mechanism used before was fetching the balance every 1 minute, which means that if a transaction affected the balance shown, a customer sometimes needed to wait a whole minute before the change would reflect on their screen. To develop these features, our team had to closely work with Product Owners, Product Managers and Architects to get the requirements, design the solution and then implement it. One of the more complicated parts for finishing these features was making sure that the dependencies on other teams are priorities and organized. Since 3 teams were working on the solution, everyone needed to make sure their part was done on time so that the other team was not blocked. Another great work experience that I gained was working on P1 bugs. They required me to act quickly and be able to think on my feet. I have solved a few bugs for US bank and Citibank projects. \n\n     As a software engineer, I was tasked with helping with some architectural design questions, doing SPIKES to gain more knowledge that we were planning on using in our solution, developing the code and testing. Throughout development, I gained a lot of experience working with Kafka, as it was the primary tool used to implement the real-time updates feature. To build the features, I had to create a Kafka library, that produces messages onto a topic and supports 2-way MTLS. For the Kafka library, I set up the Jenkins pipeline as well as Maven setup to build the project and generate a JAR. Then, I integrated that library into a microservice to notify the user about the change in the balance (the message got propagated all the way to the UI). For the printer integration feature, I got exposed to the Apache FOP library, which is used to generate different documents and images (pdf, tiff, jpg, png). I have configured the code to apply custom fonts to the documents. Overall, I have been able to actively participate in meetings with product owners and architects and contribute to the design and implementation of the project. I have immersed myself in Spring Boot, Cassandra, Apache FOP, Kafka, Kubernetes, Jenkins and Docker technologies. One of the best parts of working on these features was seeing it work after months of collaboration and different people working on all kinds of different parts of it. "
    },
    {
        "title": "NCR Voyix Culture...",
        "content": "In January, NCR Voyix moved to a new office near Waterloo University. The new office space is amazing, with a double monitor setup and fancy meeting rooms. We also have a wonderful kitchen area! The office supports a hybrid work culture and anyone can take any spot and just hook their laptop to the system, which is a neat idea. \n        \n        Even though the new office is smaller, there are still plenty of opportunities to have fun. The office has a table tennis table and a foosball table. As a part of NCR Voyix, I participated in a few work events. Our team went for lunch and we had a wide office barbeque event in July. As in previous work terms, I have really enjoyed the atmosphere and the wonderful community of people at NCR Voyix. ",
        "images": [
        {
            "src": "/ncrvoyixdesk.jpg",
            "alt": "NCR Voyix Desk"
        },
        {
            "src": "/lastteamlunch.jpg",
            "alt": "Last Team Lunch"
        }
        ]
    },
    {
        "title": "To conclude...",
        "content": "Working at NCR Voyix has been an absolutely amazing experience. In the Summer of 2024, my team worked with a customer - Citibank. It was a very cool experience to work directly with the customer and work on new features which went directly to the customer. The features were built among the existing microservices, orchestrator and UI framework. I needed to understand existing code as well as develop in an environment of constant change as other teams were making changes to the same services. I gained experience working with printers and software to generate documents. I got exposed to multiple modern technologies and further extended my understanding of planning, development, integration, and successful software delivery processes and was able to successfully contribute to these processes. Also, I had a lot of fun working with my team. With one team member, we became close friends and now go to the bouldering gym together. "
    },
    {
        "title": "Acknowledgments...",
        "content": "Throughout my journey at NCR Voyix, I learned so much. Everyone on my team has been extremely helpful and I gained a lot by working together. Specifically, I would like to acknowledge Halwasia Nikhil, Saini Arun, Pahwa Yuktika, Seth Mayank, Clifford Matthew and Noah Hinderle. All of them have been incredibly helpful throughout my time at NCR Voyix. It was a pleasure to work alongside you, thank you for your help and shared knowledge. I truly appreciate everyone's help in helping me become a better person, software engineer and teammate. Overall, all 16 months of working together have been truly wonderful. "
    }
    ]
}